<template>
  <div id="regAgreement">
    <van-nav-bar :fixed="true" class="title" title="注册协议" left-arrow @click-left="onClickLeft" />

    <div class="content">
      <p>用户注册及使用APP隐私协议</p>
      <p>在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议约定上海博履文化传播有限公司与用户之间关于“新新球鞋”软件服务（以下简称“服务”）的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由上海博履文化传播有限公司随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用上海博履文化传播有限公司提供的服务，用户继续使用上海博履文化传播有限公司的服务将被视为接受修改后的协议。</p>
      <p>一、账号注册</p>
      <p>1、用户在使用本服务前需要注册一个“新新球鞋”账号。“新新球鞋”账号应当使用手机号码绑定注册，请用户使用尚未与“新新球鞋”账号绑定的手机号码，以及未被上海博履文化传播有限公司根据本协议封禁的手机号码注册“新新球鞋”账号。上海博履文化传播有限公司可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。</p>
      <p>2、“新新球鞋”系上海博履文化传播有限公司开发的APP产品，用户注册时应当授权上海博履文化传播有限公司使用其个人信息方可成功注册“新新球鞋”账号。故用户完成注册即表明用户同意上海博履文化传播有限公司提取、使用用户的信息。</p>
      <p>3、鉴于“新新球鞋”账号的绑定注册方式，您同意上海博履文化传播有限公司在注册时将允许您的手机号码及用于注册。</p>
      <p>4、在用户注册及使用本服务时，上海博履文化传播有限公司需要搜集能识别用户身份的个人信息以便上海博履文化传播有限公司可以在必要时联系用户，或为用户提供更好的使用体验。上海博履文化传播有限公司的信息包括但不限于用户的姓名、地址；上海博履文化传播有限公司同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。</p>
      <p>二、用户个人隐私信息保护</p>
      <p>1、如果上海博履文化传播有限公司发现或收到他人举报或投诉用户违反本协议约定的，上海博履文化传播有限公司有权不经通知随时对相关内容，包括但不限于用户资料、发贴记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁 、设备封禁 、功能封禁 的处罚，且通知用户处理结果。</p>
      <p>2、因违反用户协议被封禁的用户，可以自行与上海博履文化传播有限公司联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉，上海博履文化传播有限公司将对申诉进行审查，并自行合理判断决定是否变更处罚措施。</p>
      <p>3、用户理解并同意，上海博履文化传播有限公司有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。</p>
      <p>4、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿上海博履文化传播有限公司与合作公司、关联公司，并使之免受损害。</p>
      <p>三、用户发布内容规范</p>
      <p>1、本条所述内容是指用户使用“新新球鞋”的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。</p>
      <p>2、用户不得利用“新新球鞋”账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：</p>
      <p>(1) 反对宪法所确定的基本原则的；</p>
      <p>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
      <p>(3) 损害国家荣誉和利益的；</p>
      <p>(4) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
      <p>(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p>(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p>(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
      <p>(8) 侮辱或者诽谤他人，侵害他人合法权益的；</p>
      <p>(9) 含有法律、行政法规禁止的其他内容的信息。</p>
      <p>3、用户不得利用“新新球鞋”账号或本服务制作、上载、复制、发布、传播如下干扰“新新球鞋”正常运营，以及侵犯其他用户或第三方合法权益的内容：</p>
      <p>3．新新球鞋网网站上的广告，价目表和声明并不构成要约。在新新球鞋网向您发送电子邮件确认收到并接受了您的订单之前，您和新新球鞋网之间不存在合同关系。新新球鞋网有权在发现了新新球鞋网网站上显现的产品及订单的明显错误或缺货的情况下，单方面撤回该信息或撤销合同。新新球鞋网保留对产品订购的数量的限制权。在下订单的同时，您也同时承认了您已经达到购买这些产品的法定年龄，并将对您在订单中提供的所有信息的真实性负责。</p>
      <p>4．产品价格和可获性都在网站上指明。这类信息将随时更改且不发任何通知。送货费将另外结算，费用根据您选择的送货方式的不同而异。如果发生了意外情况，在确认了您的订单后，由于库存错误，供应商提价，税额变化引起的价格变化，或是由于网站的错误等造成价格变化，新新球鞋网会通过email或电话通知您，在新新球鞋网没有取消订单的情况下，联系让您取消订单，取消订单不作赔偿。</p>
      <p>5. 预售期间商品如有调整价格，客户在收到商品七天内都可以联系客服退商品差价。由于预售的商品存在诸多不确定因素，如品牌官方推迟上市，渠道被砍单等问题导致发不出货，本店只赔付一件商品成交价5%金额。若同个账号/地址/电话/IP地址多拍某些商品的扫货行为，新新球鞋网会取消订单不作赔偿。</p>
      <p>六、其他</p>
      <p>1、上海博履文化传播有限公司郑重提醒用户注意本协议中免除上海博履文化传播有限公司责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。</p>
      <p>2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和上海博履文化传播有限公司之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交上海博履文化传播有限公司住所地有管辖权的人民法院管辖。</p>
      <p>3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。</p>
      <p>
        关于商品：
        1、您可以从商品页面知道该商品的详细信息。在预定商品的时候请确认以下各个项目：
        货号：做为该商品的唯一确认编号
        价格：目前该商品的价格
        特殊商品状态： 预发售、最新上市、再到货、已售完、 限量商品。
        2、关于商品的尺寸
        新新球鞋商城的商品尺寸根据实物测量、并会标识在查看商品尺码上；由于各品牌尺码大小有差异，不同款式之间大小亦有偏大或偏小，可先到专卖试穿或与客服咨询建议。各品牌的尺码大小请参照查看尺码对照表
      </p>
      <p>3、关于商品的颜色</p>
      <p>
        新新球鞋商城商品图片，经由色彩还原度较高的单反相机所拍摄。同样的颜色名可能根据其所标识商品品牌、种类的不同而产生图片色彩上差别。关于商品实际颜色请参考查看商品大图。
        ※根据您显示器的设定不同，实物颜色也会产生不同的色差，请预先知晓。
      </p>
      <p>4、关于海外商品，海外代购商品因海外商品特殊性，同款商品在国内和国外有可能存在细节差异（如NIKE海外商品鞋盒背面无白标等）。相关商品直接购于海外，会存在商品无中文标签，消费者如需要该商品具体信息，可联系客服给你核对查找相关信息。</p>
    </div>

    <van-tabbar v-model="active">
      <van-button class="agree" @click="agree()">不同意</van-button>
      <van-button class="disagree" @click="disagree()">同意</van-button>
    </van-tabbar>
  </div>
</template>

<script>
export default {
  name: "RegAgreement",
  methods: {
    onClickLeft() {
      this.$router.go(-1);
    },
    agree() {
      // this.$emit('agree',this.flag_true);
      this.$router.push("/register");
    },
    disagree() {
      // this.$emit('disagree',this.flag_false);
      this.$router.push("/register");
    }
  },
  data() {
    return {
      active: 0,
      fixed: "true",
      flag_true: "true",
      flag_false: "false"
    };
  }
};
</script>

<style lang="" scoped>
.van-nav-bar {
  background-color: #fcd731;
}
.van-icon-arrow-left:before {
  color: black;
}
.van-tabbar {
  background: #eeeeee;
}
.agree {
  margin-left: 20px;
  margin-top: 6px;
  width: 40%;
  height: 40px;
  background: #999999;
  font-size: 15px;
  color: white;
  border-radius: 5px;
}
.disagree {
  margin-left: 35px;
  margin-top: 6px;
  width: 40%;
  height: 40px;
  background: #fcd731;
  font-size: 15px;
  color: white;
  border-radius: 5px;
}
.content {
  margin-top: 70px;
  margin-bottom: 70px;
  padding-left: 8px;
  padding-right: 8px;
  box-sizing: border-box;
}
p {
  color: black;
  font-size: 14px;
}
</style>